#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_route53_zone.selected: Reading...
module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac"]: Refreshing state... [id=E3R7ITY1ZA9AK3]
data.aws_caller_identity.current: Reading...
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:004351562122:certificate/1d81da9d-0a13-4ccd-a520-afe401cab5c6]
data.aws_caller_identity.current: Read complete after 0s [id=004351562122]
aws_s3_bucket.logs: Refreshing state... [id=aheadinthecloud-logs-us-east-1-004351562122-prod]
aws_s3_bucket.domain: Refreshing state... [id=aheadinthecloud-us-east-1-004351562122-prod]
aws_s3_bucket_ownership_controls.logs: Refreshing state... [id=aheadinthecloud-logs-us-east-1-004351562122-prod]
aws_s3_bucket_logging.domain: Refreshing state... [id=aheadinthecloud-us-east-1-004351562122-prod]
data.aws_route53_zone.selected: Read complete after 1s [id=Z08846413OJRCH3MJOFHV]
aws_route53_record.acm["*.aheadinthecloud.com"]: Refreshing state... [id=Z08846413OJRCH3MJOFHV__34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com._CNAME]
aws_route53_record.acm["aheadinthecloud.com"]: Refreshing state... [id=Z08846413OJRCH3MJOFHV__34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com._CNAME]
aws_acm_certificate_validation.this: Refreshing state... [id=2023-07-12 20:53:34.058 +0000 UTC]
module.cloudfront.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E3AB5V8CH4QET7]
aws_route53_record.domain: Refreshing state... [id=Z08846413OJRCH3MJOFHV_aheadinthecloud.com_A]
aws_route53_record.subdomain: Refreshing state... [id=Z08846413OJRCH3MJOFHV_www.aheadinthecloud.com_A]
data.aws_iam_policy_document.oac_policy: Reading...
module.cloudfront.aws_cloudfront_monitoring_subscription.this[0]: Refreshing state... [id=E3AB5V8CH4QET7]
data.aws_iam_policy_document.oac_policy: Read complete after 0s [id=245180501]
aws_s3_bucket_policy.domain: Refreshing state... [id=aheadinthecloud-us-east-1-004351562122-prod]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cloudfront.aws_cloudfront_distribution.this[0] has changed
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E3AB5V8CH4QET7"
      ~ status                         = "InProgress" -> "Deployed"
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_function.append_index will be created
  + resource "aws_cloudfront_function" "append_index" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
              var request = event.request;
              var uri = request.uri;
            
              // Check whether the URI is missing a file name.
              if (uri.endsWith('/')) {
                  request.uri += 'index.html';
              }
              // Check whether the URI is missing a file extension.
              else if (!uri.includes('.')) {
                  request.uri += '/index.html';
              }
            
              return request;
            }
        EOT
      + comment         = "append index.html to requests"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "append-index"
      + publish         = true
      + runtime         = "cloudfront-js-1.0"
      + status          = (known after apply)
    }

  # module.cloudfront.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E3AB5V8CH4QET7"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ viewer_protocol_policy = "allow-all" -> "redirect-to-https"
            # (10 unchanged attributes hidden)

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }

            # (1 unchanged block hidden)
        }

      - ordered_cache_behavior {
          - allowed_methods        = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
            ] -> null
          - compress               = true -> null
          - default_ttl            = 0 -> null
          - max_ttl                = 0 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "s3" -> null
          - trusted_key_groups     = [] -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

        # (6 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*